VoltCyclone/imxrtnsy/src/kmbox.c
// Multi-protocol command injection over UART (LPUART7 when BT_ENABLED, else LPUART6)
// Auto-detects and handles three protocols on the same UART:
//   - KMBox B binary: sync 0x57 0xAB, cmd, len, payload, checksum
//   - Makcu binary:   sync 0x50, cmd, len_lo, len_hi, payload
//   - Ferrum text:    km.command(args)\n  (any printable ASCII start)
//
// Integrates smooth injection queue with FPU-based humanization tremor.
// Merges injected keyboard/mouse inputs additively with real device HID reports.

#include "kmbox.h"
#include "smooth.h"
#include "ferrum.h"
#include "makcu.h"
#include "imxrt.h"
#include "usb_device.h"
#include <string.h>

extern uint32_t millis(void);

// ---- UART constants ----
#ifndef UART_BAUD
#define UART_BAUD  2000000
#endif
#define UART_CLOCK 24000000

// ---- Hardware abstraction: select LPUART peripheral and DMA channels ----
#if BT_ENABLED
// LPUART7 on Teensy pins 28 (RX7) / 29 (TX7) for Bluetooth serial
#undef  UART_BAUD
#define UART_BAUD          BT_BAUD

#define KM_UART_BAUD       LPUART7_BAUD
#define KM_UART_CTRL       LPUART7_CTRL
#define KM_UART_STAT       LPUART7_STAT
#define KM_UART_DATA       LPUART7_DATA
#define KM_UART_FIFO       LPUART7_FIFO
#define KM_UART_WATER      LPUART7_WATER

#define KM_RX_SADDR        DMA_TCD3_SADDR
#define KM_RX_SOFF         DMA_TCD3_SOFF
#define KM_RX_ATTR         DMA_TCD3_ATTR
#define KM_RX_NBYTES       DMA_TCD3_NBYTES_MLNO
#define KM_RX_SLAST        DMA_TCD3_SLAST
#define KM_RX_DADDR        DMA_TCD3_DADDR
#define KM_RX_DOFF         DMA_TCD3_DOFF
#define KM_RX_CITER        DMA_TCD3_CITER_ELINKNO
#define KM_RX_BITER        DMA_TCD3_BITER_ELINKNO
#define KM_RX_DLASTSGA     DMA_TCD3_DLASTSGA
#define KM_RX_CSR          DMA_TCD3_CSR
#define KM_RX_DMAMUX       DMAMUX_CHCFG3
#define KM_RX_DMAMUX_SRC   DMAMUX_SOURCE_LPUART7_RX
#define KM_RX_CH           3

#define KM_TX_SADDR        DMA_TCD4_SADDR
#define KM_TX_SOFF         DMA_TCD4_SOFF
#define KM_TX_ATTR         DMA_TCD4_ATTR
#define KM_TX_NBYTES       DMA_TCD4_NBYTES_MLNO
#define KM_TX_SLAST        DMA_TCD4_SLAST
#define KM_TX_DADDR        DMA_TCD4_DADDR
#define KM_TX_DOFF         DMA_TCD4_DOFF
#define KM_TX_CITER        DMA_TCD4_CITER_ELINKNO
#define KM_TX_BITER        DMA_TCD4_BITER_ELINKNO
#define KM_TX_DLASTSGA     DMA_TCD4_DLASTSGA
#define KM_TX_CSR          DMA_TCD4_CSR
#define KM_TX_DMAMUX       DMAMUX_CHCFG4
#define KM_TX_DMAMUX_SRC   DMAMUX_SOURCE_LPUART7_TX
#define KM_TX_CH           4

#else
// LPUART6 on Teensy pins 0 (RX1) / 1 (TX1) — default
#define KM_UART_BAUD       LPUART6_BAUD
#define KM_UART_CTRL       LPUART6_CTRL
#define KM_UART_STAT       LPUART6_STAT
#define KM_UART_DATA       LPUART6_DATA
#define KM_UART_FIFO       LPUART6_FIFO
#define KM_UART_WATER      LPUART6_WATER

#define KM_RX_SADDR        DMA_TCD0_SADDR
#define KM_RX_SOFF         DMA_TCD0_SOFF
#define KM_RX_ATTR         DMA_TCD0_ATTR
#define KM_RX_NBYTES       DMA_TCD0_NBYTES_MLNO
#define KM_RX_SLAST        DMA_TCD0_SLAST
#define KM_RX_DADDR        DMA_TCD0_DADDR
#define KM_RX_DOFF         DMA_TCD0_DOFF
#define KM_RX_CITER        DMA_TCD0_CITER_ELINKNO
#define KM_RX_BITER        DMA_TCD0_BITER_ELINKNO
#define KM_RX_DLASTSGA     DMA_TCD0_DLASTSGA
#define KM_RX_CSR          DMA_TCD0_CSR
#define KM_RX_DMAMUX       DMAMUX_CHCFG0
#define KM_RX_DMAMUX_SRC   DMAMUX_SOURCE_LPUART6_RX
#define KM_RX_CH           0

#define KM_TX_SADDR        DMA_TCD2_SADDR
#define KM_TX_SOFF         DMA_TCD2_SOFF
#define KM_TX_ATTR         DMA_TCD2_ATTR
#define KM_TX_NBYTES       DMA_TCD2_NBYTES_MLNO
#define KM_TX_SLAST        DMA_TCD2_SLAST
#define KM_TX_DADDR        DMA_TCD2_DADDR
#define KM_TX_DOFF         DMA_TCD2_DOFF
#define KM_TX_CITER        DMA_TCD2_CITER_ELINKNO
#define KM_TX_BITER        DMA_TCD2_BITER_ELINKNO
#define KM_TX_DLASTSGA     DMA_TCD2_DLASTSGA
#define KM_TX_CSR          DMA_TCD2_CSR
#define KM_TX_DMAMUX       DMAMUX_CHCFG2
#define KM_TX_DMAMUX_SRC   DMAMUX_SOURCE_LPUART6_TX
#define KM_TX_CH           2

#endif

// ---- eDMA RX ring buffer (non-cacheable via MPU region 10) ----
#define DMA_RX_RING_SIZE 256
static uint8_t dma_rx_ring[DMA_RX_RING_SIZE]
	__attribute__((section(".dmabuffers"), aligned(DMA_RX_RING_SIZE)));
static volatile uint16_t rx_tail;

// ---- eDMA TX: staging ring -> DMA TX channel -> UART DATA ----
// Software ring for staging; DMA copies contiguous chunks to UART hardware.
#define TX_RING_SIZE 128
static uint8_t tx_ring[TX_RING_SIZE];
static uint8_t tx_head;
static uint8_t tx_tail_pos;

// DMA TX linear buffer — non-cacheable for DMA coherency
#define DMA_TX_BUF_SIZE 64
static uint8_t dma_tx_buf[DMA_TX_BUF_SIZE]
	__attribute__((section(".dmabuffers"), aligned(4)));

// ---- Multi-protocol dispatcher state ----
typedef enum {
	PROTO_IDLE,       // waiting for first byte to determine protocol
	PROTO_KMBOX,      // in KMBox B binary frame
	PROTO_MAKCU,      // in Makcu binary frame
	PROTO_FERRUM      // accumulating text line
} proto_mode_t;

// ---- KMBox B parser states ----
typedef enum {
	KB_SYNC2,
	KB_CMD,
	KB_LEN,
	KB_PAYLOAD,
	KB_CHECKSUM
} kb_state_t;

// ---- Makcu parser states ----
typedef enum {
	MK_CMD,
	MK_LEN_LO,
	MK_LEN_HI,
	MK_PAYLOAD
} mk_state_t;

// ---- Injection state ----
typedef struct {
	int16_t  mouse_dx;
	int16_t  mouse_dy;
	uint8_t  mouse_buttons;
	int8_t   mouse_wheel;
	bool     mouse_dirty;

	uint8_t  kb_modifier;
	uint8_t  kb_keys[6];
	bool     kb_dirty;

	// Click auto-release: mask of buttons to release after click_release_at
	uint8_t  click_release_mask;
	uint32_t click_release_at; // millis() timestamp, 0 = inactive
} kmbox_inject_t;

// ---- Static state ----

// Protocol dispatcher
static proto_mode_t proto_mode;

// KMBox B parser
static kb_state_t   kb_parse_state;
static uint8_t      frame_buf[KMBOX_MAX_PAYLOAD];
static uint8_t      frame_cmd;
static uint8_t      frame_len;
static uint8_t      frame_pos;
static uint8_t      frame_checksum;

// Makcu parser
static mk_state_t   mk_parse_state;
static uint8_t      mk_cmd;
static uint16_t     mk_len;
static uint16_t     mk_pos;
static uint8_t      mk_buf[MAKCU_MAX_PAYLOAD];

// Ferrum line buffer
static char         ferrum_line[FERRUM_MAX_LINE];
static uint8_t      ferrum_pos;

// Shared injection state
static kmbox_inject_t inject;
static uint32_t frames_ok;
static uint32_t frames_err;
static uint32_t rx_bytes_total;

// Cached EP info — set once at enumeration, avoids per-poll iface scanning
static uint8_t  cached_mouse_ep;    // EP number for mouse (0 = not found)
static uint16_t cached_mouse_maxpkt;
static uint8_t  cached_kb_ep;       // EP number for keyboard (0 = not found)
// Mouse report field layout — parsed from HID report descriptor
static struct {
	uint16_t x_bit;         // bit offset of X in data (after report ID byte)
	uint16_t y_bit;         // bit offset of Y
	uint16_t wheel_bit;     // bit offset of wheel (0xFFFF = none)
	uint8_t  x_size;        // X field size in bits (8 or 16 typically)
	uint8_t  y_size;        // Y field size in bits
	uint8_t  wheel_size;    // wheel field size in bits
	uint8_t  report_id;     // 0 = no report ID byte
	uint8_t  data_off;      // byte offset of data start (0 or 1)
	bool     valid;         // true if X and Y were found
	int16_t  x_max;         // precomputed (1 << (x_size-1)) - 1
	int16_t  y_max;         // precomputed (1 << (y_size-1)) - 1
	int16_t  w_max;         // precomputed (1 << (wheel_size-1)) - 1
} mouse_layout;
static uint8_t cached_mouse_report_len; // actual report length from first real report

// Track whether a merge happened this cycle (reset each poll)
static bool merged_this_cycle;

// ---- Forward declarations ----
static void dispatch_kmbox_frame(void);
static void dispatch_makcu_frame(void);
static void dispatch_ferrum_line(void);
static void apply_mouse_result(int16_t dx, int16_t dy, uint8_t buttons,
                               int8_t wheel, bool use_smooth);

// ---- Non-blocking TX: enqueue to ring, DMA flushes to UART ----
static void tx_enqueue(uint8_t b)
{
	uint8_t next = (tx_head + 1) & (TX_RING_SIZE - 1);
	if (next == tx_tail_pos) return; // full — drop byte
	tx_ring[tx_head] = b;
	tx_head = next;
}

