VoltCyclone/imxrtnsy/src/kmbox.c
static void tx_enqueue_buf(const uint8_t *data, uint8_t len)
{
	for (uint8_t i = 0; i < len; i++)
		tx_enqueue(data[i]);
}

static void tx_enqueue_str(const char *s)
{
	while (*s) tx_enqueue((uint8_t)*s++);
}

// Kick DMA channel 2 to send a contiguous chunk from the ring buffer.
// Called from kmbox_poll. Copies pending ring bytes into the linear DMA
// staging buffer, then fires a single DMA transfer. Hardware drains one
// byte per TDRE — zero CPU until next poll.
static void tx_flush(void)
{
	// If previous transfer still in flight, let it finish
	if (!(KM_TX_CSR & DMA_TCD_CSR_DONE) &&
	    KM_TX_CITER != KM_TX_BITER)
		return;
	DMA_CDNE = KM_TX_CH; // clear DONE flag for next transfer

	// Copy pending ring bytes into linear DMA buffer
	uint8_t count = 0;
	while (tx_tail_pos != tx_head && count < DMA_TX_BUF_SIZE) {
		dma_tx_buf[count++] = tx_ring[tx_tail_pos];
		tx_tail_pos = (tx_tail_pos + 1) & (TX_RING_SIZE - 1);
	}
	if (count == 0) return;

	// Update only the 3 TCD fields that change per flush (static fields set in kmbox_init)
	KM_TX_SADDR = (volatile const void *)dma_tx_buf;
	KM_TX_CITER = count;
	KM_TX_BITER = count;
	KM_TX_CSR = DMA_TCD_CSR_DREQ; // auto-disable requests on completion
	DMA_SERQ = KM_TX_CH; // enable TX DMA channel requests
}
void kmbox_init(void)
{
#if NET_ENABLED
	// NET mode: skip UART/DMA setup — commands come from Ethernet
	memset(&inject, 0, sizeof(inject));
	frames_ok = 0;
	frames_err = 0;
	cached_mouse_ep = 0;
	cached_mouse_maxpkt = 0;
	cached_kb_ep = 0;
	memset(&mouse_layout, 0, sizeof(mouse_layout));
	mouse_layout.wheel_bit = 0xFFFF;
	cached_mouse_report_len = 0;
	return;
#endif
#if BT_ENABLED
	// LPUART7: pin 29 (GPIO_AD_B1_02) = TX, pin 28 (GPIO_AD_B1_03) = RX
	CCM_CCGR5 |= CCM_CCGR5_LPUART7(CCM_CCGR_ON);
	IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02 = 2;
	IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_02 =
		IOMUXC_PAD_DSE(6) | IOMUXC_PAD_SPEED(2);
	IOMUXC_LPUART7_TX_SELECT_INPUT = 1;
	IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03 = 2;
	IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_03 =
		IOMUXC_PAD_DSE(6) | IOMUXC_PAD_SPEED(2) |
		IOMUXC_PAD_PKE | IOMUXC_PAD_PUE | IOMUXC_PAD_PUS(3);
	IOMUXC_LPUART7_RX_SELECT_INPUT = 1;
#else
	// LPUART6: pin 1 (GPIO_AD_B0_02) = TX, pin 0 (GPIO_AD_B0_03) = RX
	CCM_CCGR3 |= CCM_CCGR3_LPUART6(CCM_CCGR_ON);
	IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02 = 2;
	IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02 =
		IOMUXC_PAD_DSE(6) | IOMUXC_PAD_SPEED(2);
	IOMUXC_LPUART6_TX_SELECT_INPUT = 1;
	IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03 = 2;
	IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_03 =
		IOMUXC_PAD_DSE(6) | IOMUXC_PAD_SPEED(2) |
		IOMUXC_PAD_PKE | IOMUXC_PAD_PUE | IOMUXC_PAD_PUS(3);
	IOMUXC_LPUART6_RX_SELECT_INPUT = 1;
#endif

	// Baud: pick OSR so SBR >= 1 (e.g. 2M @ 24MHz -> OSR=11, SBR=1)
	uint32_t osr;
	if (UART_BAUD <= 460800) {
		osr = 15;
	} else {
		osr = UART_CLOCK / UART_BAUD - 1;
		if (osr < 4) osr = 4;
	}
	uint32_t sbr = UART_CLOCK / (UART_BAUD * (osr + 1));
	if (sbr == 0) sbr = 1;
	KM_UART_BAUD = LPUART_BAUD_OSR(osr) | LPUART_BAUD_SBR(sbr);

	// Disable TE/RE before FIFO config (required by i.MX RT datasheet).
	// uart_init() may have already enabled them when UART_ENABLED=1.
	KM_UART_CTRL = 0;

	// Enable 4-entry RX and TX hardware FIFOs (must be set while TE/RE clear)
	KM_UART_FIFO = LPUART_FIFO_RXFE | LPUART_FIFO_TXFE;
	KM_UART_FIFO |= LPUART_FIFO_TXFLUSH | LPUART_FIFO_RXFLUSH;
	KM_UART_WATER = LPUART_WATER_RXWATER(1);

	KM_UART_CTRL = LPUART_CTRL_TE | LPUART_CTRL_RE;

	// ---- eDMA RX: UART DATA register -> ring buffer ----
	CCM_CCGR5 |= CCM_CCGR5_DMA(CCM_CCGR_ON);
	KM_RX_DMAMUX = 0; // disable before reconfiguring
	KM_RX_SADDR = (volatile const void *)&KM_UART_DATA;
	KM_RX_SOFF = 0;
	KM_RX_ATTR = DMA_TCD_ATTR_SSIZE(DMA_TCD_ATTR_SIZE_8BIT) |
	             DMA_TCD_ATTR_DSIZE(DMA_TCD_ATTR_SIZE_8BIT);
	KM_RX_NBYTES = 1;
	KM_RX_SLAST = 0;
	KM_RX_DADDR = (volatile void *)dma_rx_ring;
	KM_RX_DOFF = 1;
	KM_RX_CITER = DMA_RX_RING_SIZE;
	KM_RX_BITER = DMA_RX_RING_SIZE;
	KM_RX_DLASTSGA = -DMA_RX_RING_SIZE;
	KM_RX_CSR = 0; // no DREQ — continuous circular operation
	KM_RX_DMAMUX = KM_RX_DMAMUX_SRC | DMAMUX_CHCFG_ENBL;
	DMA_SERQ = KM_RX_CH;
	KM_UART_BAUD |= LPUART_BAUD_RDMAE; // route RX to DMA
	rx_tail = 0;

	// ---- eDMA TX: dma_tx_buf -> UART DATA register ----
	// Pre-fill static TCD fields once; tx_flush only updates SADDR/CITER/BITER.
	KM_TX_DMAMUX = 0;
	KM_TX_SADDR = (volatile const void *)dma_tx_buf;
	KM_TX_SOFF = 1;
	KM_TX_ATTR = DMA_TCD_ATTR_SSIZE(DMA_TCD_ATTR_SIZE_8BIT) |
	             DMA_TCD_ATTR_DSIZE(DMA_TCD_ATTR_SIZE_8BIT);
	KM_TX_NBYTES = 1;
	KM_TX_SLAST = 0;
	KM_TX_DADDR = (volatile void *)&KM_UART_DATA;
	KM_TX_DOFF = 0;
	KM_TX_DLASTSGA = 0;
	KM_TX_CSR = DMA_TCD_CSR_DONE; // mark idle so first tx_flush succeeds
	KM_TX_DMAMUX = KM_TX_DMAMUX_SRC | DMAMUX_CHCFG_ENBL;
	KM_UART_BAUD |= LPUART_BAUD_TDMAE; // route TX FIFO ready to DMA

	tx_head = 0;
	tx_tail_pos = 0;
	proto_mode = PROTO_IDLE;
	kb_parse_state = KB_SYNC2;
	mk_parse_state = MK_CMD;
	ferrum_pos = 0;
	memset(&inject, 0, sizeof(inject));
	frames_ok = 0;
	frames_err = 0;

	cached_mouse_ep = 0;
	cached_mouse_maxpkt = 0;
	cached_kb_ep = 0;
	memset(&mouse_layout, 0, sizeof(mouse_layout));
	mouse_layout.wheel_bit = 0xFFFF;
	cached_mouse_report_len = 0;

	ferrum_init();
	makcu_init();
	smooth_init(1000); // default 1kHz, main.c re-inits with actual rate
}

// ---- HID report descriptor parser ----

// Parse mouse HID report descriptor to find X, Y, wheel bit positions and sizes.
// This is essential because mice vary: 8-bit X/Y (boot-like), 16-bit X/Y (gaming),
// 12-bit fields, etc.  Without parsing, we'd guess wrong and corrupt reports.
static void parse_mouse_layout(const uint8_t *rd, uint16_t rdlen)
{
	memset(&mouse_layout, 0, sizeof(mouse_layout));
	mouse_layout.wheel_bit = 0xFFFF;

	uint16_t usage_page = 0;
	uint8_t  usages[16];
	uint8_t  num_usages = 0;
	uint16_t usage_min = 0, usage_max = 0;
	uint8_t  report_size = 0;
	uint8_t  report_count = 0;
	uint8_t  current_rid = 0;
	uint16_t bit_pos = 0;

	uint16_t i = 0;
	while (i < rdlen) {
		uint8_t b = rd[i];
		if (b == 0xFE) { // long item — skip
			if (i + 2 < rdlen) i += 3 + rd[i + 1];
			else break;
			continue;
		}

