VoltCyclone/imxrtnsy/src/kmbox.c
		uint8_t sz = b & 0x03;
		if (sz == 3) sz = 4;
		if (i + 1 + sz > rdlen) break;

		// Read unsigned data
		uint32_t val = 0;
		if (sz >= 1) val = rd[i + 1];
		if (sz >= 2) val |= (uint32_t)rd[i + 2] << 8;
		if (sz >= 4) val |= (uint32_t)rd[i + 3] << 16 | (uint32_t)rd[i + 4] << 24;

		switch (b & 0xFC) {
		case 0x04: usage_page = (uint16_t)val; break;   // Usage Page
		case 0x74: report_size = (uint8_t)val; break;    // Report Size
		case 0x94: report_count = (uint8_t)val; break;   // Report Count
		case 0x84:                                        // Report ID
			current_rid = (uint8_t)val;
			bit_pos = 0;
			break;

		case 0x08: // Usage
			if (num_usages < 16) usages[num_usages++] = (uint8_t)val;
			break;
		case 0x18: usage_min = (uint16_t)val; break;     // Usage Minimum
		case 0x28: usage_max = (uint16_t)val; break;     // Usage Maximum

		case 0x80: { // Input
			if (num_usages == 0 && usage_max >= usage_min) {
				for (uint16_t u = usage_min; u <= usage_max && num_usages < 16; u++)
					usages[num_usages++] = (uint8_t)u;
			}

			for (uint8_t f = 0; f < report_count; f++) {
				uint8_t u = (f < num_usages) ? usages[f] :
				            (num_usages > 0 ? usages[num_usages - 1] : 0);

				if (usage_page == 0x01) { // Generic Desktop
					if (u == 0x30) { // X
						mouse_layout.x_bit = bit_pos;
						mouse_layout.x_size = report_size;
						mouse_layout.report_id = current_rid;
					} else if (u == 0x31) { // Y
						mouse_layout.y_bit = bit_pos;
						mouse_layout.y_size = report_size;
					} else if (u == 0x38) { // Wheel
						mouse_layout.wheel_bit = bit_pos;
						mouse_layout.wheel_size = report_size;
					}
				}
				bit_pos += report_size;
			}
			// Clear local state after Main item
			num_usages = 0;
			usage_min = 0;
			usage_max = 0;
			break;
		}
		case 0xA0: // Collection
			num_usages = 0;
			usage_min = 0;
			usage_max = 0;
			break;
		case 0xC0: // End Collection
			num_usages = 0;
			break;
		}

		i += 1 + sz;
	}

	mouse_layout.data_off = mouse_layout.report_id ? 1 : 0;
	mouse_layout.valid = (mouse_layout.x_size > 0 && mouse_layout.y_size > 0);
	mouse_layout.x_max = mouse_layout.x_size > 0 ? (int16_t)((1 << (mouse_layout.x_size - 1)) - 1) : 0;
	mouse_layout.y_max = mouse_layout.y_size > 0 ? (int16_t)((1 << (mouse_layout.y_size - 1)) - 1) : 0;
	mouse_layout.w_max = mouse_layout.wheel_size > 0 ? (int16_t)((1 << (mouse_layout.wheel_size - 1)) - 1) : 0;
}

// Read signed value from bit position in a report buffer.
// bit_off is relative to data start; data_off is byte offset of data (0 or 1).
static int32_t read_report_field(const uint8_t *buf, uint16_t bit_off,
                                 uint8_t bit_size, uint8_t data_off)
{
	uint16_t abs_bit = bit_off + (uint16_t)data_off * 8;
	uint16_t byte_idx = abs_bit >> 3;
	uint8_t  bit_idx = abs_bit & 7;

	if (__builtin_expect(bit_idx == 0, 1)) {
		if (bit_size == 16) return (int16_t)(buf[byte_idx] | ((uint16_t)buf[byte_idx + 1] << 8));
		if (bit_size == 8)  return (int8_t)buf[byte_idx];
	}

	uint32_t raw = 0;
	uint8_t bytes_needed = (bit_idx + bit_size + 7) >> 3;
	for (uint8_t b = 0; b < bytes_needed; b++)
		raw |= (uint32_t)buf[byte_idx + b] << (b * 8);
	raw = (raw >> bit_idx) & ((1u << bit_size) - 1);
	if (raw & (1u << (bit_size - 1)))
		raw |= ~((1u << bit_size) - 1); // sign extend
	return (int32_t)raw;
}

static void write_report_field(uint8_t *buf, uint16_t bit_off,
                               uint8_t bit_size, uint8_t data_off, int32_t value)
{
	uint16_t abs_bit = bit_off + (uint16_t)data_off * 8;
	uint16_t byte_idx = abs_bit >> 3;
	uint8_t  bit_idx = abs_bit & 7;

	if (__builtin_expect(bit_idx == 0, 1)) {
		if (bit_size == 16) {
			buf[byte_idx]     = (uint8_t)(value & 0xFF);
			buf[byte_idx + 1] = (uint8_t)((value >> 8) & 0xFF);
			return;
		}
		if (bit_size == 8) {
			buf[byte_idx] = (uint8_t)(int8_t)value;
			return;
		}
	}

	uint32_t mask = ((1u << bit_size) - 1) << bit_idx;
	uint32_t val  = ((uint32_t)value & ((1u << bit_size) - 1)) << bit_idx;
	uint8_t bytes_needed = (bit_idx + bit_size + 7) >> 3;
	for (uint8_t b = 0; b < bytes_needed; b++) {
		uint8_t m = (mask >> (b * 8)) & 0xFF;
		uint8_t v = (val  >> (b * 8)) & 0xFF;
		buf[byte_idx + b] = (buf[byte_idx + b] & ~m) | v;
	}
}

void kmbox_cache_endpoints(const captured_descriptors_t *desc)
{
	cached_mouse_ep = 0;
	cached_kb_ep = 0;
	memset(&mouse_layout, 0, sizeof(mouse_layout));
	mouse_layout.wheel_bit = 0xFFFF;
	cached_mouse_report_len = 0;
	for (uint8_t i = 0; i < desc->num_ifaces; i++) {
		if (desc->ifaces[i].interrupt_ep == 0) continue;
		uint8_t ep = desc->ifaces[i].interrupt_ep & 0x0F;
		if (desc->ifaces[i].iface_protocol == 2 && !cached_mouse_ep) {
			cached_mouse_ep = ep;
			cached_mouse_maxpkt = desc->ifaces[i].interrupt_maxpkt;
			parse_mouse_layout(desc->ifaces[i].hid_report_desc,
			                   desc->ifaces[i].hid_report_desc_len);
		} else if (desc->ifaces[i].iface_protocol == 1 && !cached_kb_ep) {
			cached_kb_ep = ep;
		}
	}
}

void kmbox_poll(void)
{
#if NET_ENABLED
	merged_this_cycle = false;
	return; // NET mode: commands come from kmnet_poll()
#endif
	merged_this_cycle = false;
	tx_flush();
	uint32_t stat = KM_UART_STAT;
	if (__builtin_expect(stat & (LPUART_STAT_OR | LPUART_STAT_FE | LPUART_STAT_NF), 0)) {
		KM_UART_STAT = stat & (LPUART_STAT_OR | LPUART_STAT_FE | LPUART_STAT_NF);
		proto_mode = PROTO_IDLE;
		ferrum_pos = 0;
	}

	if (__builtin_expect(inject.click_release_at, 0) && millis() >= inject.click_release_at) {
		inject.mouse_buttons &= ~inject.click_release_mask;
		inject.mouse_dirty = true;
		inject.click_release_mask = 0;
		inject.click_release_at = 0;
	}

	uint16_t head = ((uint32_t)KM_RX_DADDR - (uint32_t)dma_rx_ring) & (DMA_RX_RING_SIZE - 1);
	while (rx_tail != head) {
		uint8_t b = dma_rx_ring[rx_tail];
		rx_tail = (rx_tail + 1) & (DMA_RX_RING_SIZE - 1);
		rx_bytes_total++;

		switch (proto_mode) {
		case PROTO_IDLE:
			if (b == KMBOX_SYNC1) {
				proto_mode = PROTO_KMBOX;
				frame_checksum = b;
				kb_parse_state = KB_SYNC2;
			} else if (b == MAKCU_SYNC_BYTE) {
				proto_mode = PROTO_MAKCU;
				mk_parse_state = MK_CMD;
			} else if (b >= 0x20 && b < 0x7F) {
				proto_mode = PROTO_FERRUM;
				ferrum_pos = 0;
				ferrum_line[ferrum_pos++] = (char)b;
			}
			break;
		case PROTO_KMBOX:
			switch (kb_parse_state) {
			case KB_SYNC2:
				if (b == KMBOX_SYNC2) {
					frame_checksum += b;
					kb_parse_state = KB_CMD;
				} else if (b == KMBOX_SYNC1) {
					frame_checksum = b;
				} else {
					proto_mode = PROTO_IDLE;
				}
				break;
			case KB_CMD:
				frame_cmd = b;
				frame_checksum += b;
				kb_parse_state = KB_LEN;
				break;
			case KB_LEN:
				frame_len = b;
				frame_checksum += b;
				if (frame_len > KMBOX_MAX_PAYLOAD) {
					frames_err++;
					proto_mode = PROTO_IDLE;
				} else if (frame_len == 0) {
					kb_parse_state = KB_CHECKSUM;
				} else {
					frame_pos = 0;
					kb_parse_state = KB_PAYLOAD;
				}
				break;
			case KB_PAYLOAD:
				frame_buf[frame_pos++] = b;
				frame_checksum += b;
				if (frame_pos >= frame_len) {
					kb_parse_state = KB_CHECKSUM;
				}
				break;
			case KB_CHECKSUM:
				if ((frame_checksum & 0xFF) == b) {
					dispatch_kmbox_frame();
					frames_ok++;
				} else {
					frames_err++;
				}
				proto_mode = PROTO_IDLE;
				break;
			}
			break;

		case PROTO_MAKCU:
			switch (mk_parse_state) {
			case MK_CMD:
				mk_cmd = b;
				mk_parse_state = MK_LEN_LO;
				break;
			case MK_LEN_LO:
				mk_len = b;
				mk_parse_state = MK_LEN_HI;
				break;
			case MK_LEN_HI:
				mk_len |= (uint16_t)b << 8;
				if (mk_len > MAKCU_MAX_PAYLOAD) {
					frames_err++;
					proto_mode = PROTO_IDLE;
				} else if (mk_len == 0) {
					dispatch_makcu_frame();
					frames_ok++;
					proto_mode = PROTO_IDLE;
				} else {
					mk_pos = 0;
					mk_parse_state = MK_PAYLOAD;
				}
				break;
			case MK_PAYLOAD:
				mk_buf[mk_pos++] = b;
				if (mk_pos >= mk_len) {
					dispatch_makcu_frame();
					frames_ok++;
					proto_mode = PROTO_IDLE;
				}
				break;
			}
			break;
		case PROTO_FERRUM:
			if (b == '\n' || b == '\r') {
				if (ferrum_pos > 0) {
					ferrum_line[ferrum_pos] = '\0';
					dispatch_ferrum_line();
				}
				ferrum_pos = 0;
				proto_mode = PROTO_IDLE;
			} else if (ferrum_pos < FERRUM_MAX_LINE - 1) {
				ferrum_line[ferrum_pos++] = (char)b;
			} else {
				ferrum_pos = 0;
				proto_mode = PROTO_IDLE;
			}
			break;
		}
	}

