VoltCyclone/imxrtnsy/src/kmbox.c
}

void kmbox_merge_report(uint8_t iface_protocol, uint8_t * restrict report, uint8_t len)
{
	if (iface_protocol == 2) {
		if (__builtin_expect(cached_mouse_report_len == 0, 0))
			cached_mouse_report_len = len;

		if (mouse_layout.valid &&
		    (inject.mouse_dx || inject.mouse_dy ||
		     inject.mouse_buttons || inject.mouse_wheel)) {
			uint8_t doff = mouse_layout.data_off;

			report[doff] |= inject.mouse_buttons;

			int32_t rx = read_report_field(report, mouse_layout.x_bit,
			                               mouse_layout.x_size, doff);
			int32_t mx = rx + inject.mouse_dx;
			if (mx > mouse_layout.x_max) mx = mouse_layout.x_max;
			if (mx < -mouse_layout.x_max) mx = -mouse_layout.x_max;
			write_report_field(report, mouse_layout.x_bit,
			                   mouse_layout.x_size, doff, mx);

			int32_t ry = read_report_field(report, mouse_layout.y_bit,
			                               mouse_layout.y_size, doff);
			int32_t my = ry + inject.mouse_dy;
			if (my > mouse_layout.y_max) my = mouse_layout.y_max;
			if (my < -mouse_layout.y_max) my = -mouse_layout.y_max;
			write_report_field(report, mouse_layout.y_bit,
			                   mouse_layout.y_size, doff, my);

			if (mouse_layout.wheel_bit != 0xFFFF && inject.mouse_wheel != 0) {
				int32_t rw = read_report_field(report, mouse_layout.wheel_bit,
				                               mouse_layout.wheel_size, doff);
				int32_t mw = rw + inject.mouse_wheel;
				if (mw > mouse_layout.w_max) mw = mouse_layout.w_max;
				if (mw < -mouse_layout.w_max) mw = -mouse_layout.w_max;
				write_report_field(report, mouse_layout.wheel_bit,
				                   mouse_layout.wheel_size, doff, mw);
			}

			inject.mouse_dx = 0;
			inject.mouse_dy = 0;
			inject.mouse_wheel = 0;
			inject.mouse_dirty = false;
		}
		merged_this_cycle = true;
	} else if (iface_protocol == 1 && inject.kb_dirty) {
		if (len >= 8) {
			report[0] |= inject.kb_modifier;
			for (int i = 0; i < 6; i++) {
				if (inject.kb_keys[i] == 0) continue;
				bool found = false;
				for (int j = 2; j < 8; j++) {
					if (report[j] == inject.kb_keys[i]) {
						found = true;
						break;
					}
				}
				if (!found) {
					for (int j = 2; j < 8; j++) {
						if (report[j] == 0) {
							report[j] = inject.kb_keys[i];
							break;
						}
					}
				}
			}
		}
		merged_this_cycle = true;
	}
}

void kmbox_send_pending(void)
{
	if (merged_this_cycle) return;
	if (inject.mouse_dirty && cached_mouse_ep && mouse_layout.valid) {
		uint8_t synth[16];
		memset(synth, 0, sizeof(synth));
		uint8_t doff = mouse_layout.data_off;
		if (doff) synth[0] = mouse_layout.report_id;
		synth[doff] = inject.mouse_buttons;
		int32_t dx = inject.mouse_dx;
		int32_t dy = inject.mouse_dy;
		if (dx > mouse_layout.x_max) dx = mouse_layout.x_max;
		if (dx < -mouse_layout.x_max) dx = -mouse_layout.x_max;
		if (dy > mouse_layout.y_max) dy = mouse_layout.y_max;
		if (dy < -mouse_layout.y_max) dy = -mouse_layout.y_max;

		write_report_field(synth, mouse_layout.x_bit,
		                   mouse_layout.x_size, doff, dx);
		write_report_field(synth, mouse_layout.y_bit,
		                   mouse_layout.y_size, doff, dy);

		if (mouse_layout.wheel_bit != 0xFFFF && inject.mouse_wheel != 0) {
			int32_t w = inject.mouse_wheel;
			if (w > mouse_layout.w_max) w = mouse_layout.w_max;
			if (w < -mouse_layout.w_max) w = -mouse_layout.w_max;
			write_report_field(synth, mouse_layout.wheel_bit,
			                   mouse_layout.wheel_size, doff, w);
		}
		uint8_t rlen = cached_mouse_report_len;
		if (rlen == 0) rlen = (cached_mouse_maxpkt < 16) ? (uint8_t)cached_mouse_maxpkt : 16;
		usb_device_send_report(cached_mouse_ep, synth, rlen);
		inject.mouse_dx = 0;
		inject.mouse_dy = 0;
		inject.mouse_wheel = 0;
		inject.mouse_dirty = false;
	}
	if (inject.kb_dirty && cached_kb_ep) {
		uint8_t synth[8];
		synth[0] = inject.kb_modifier;
		synth[1] = 0;
		memcpy(&synth[2], inject.kb_keys, 6);
		usb_device_send_report(cached_kb_ep, synth, 8);
	}
}

void kmbox_inject_smooth(int16_t dx, int16_t dy)
{
	inject.mouse_dx += dx;
	inject.mouse_dy += dy;
	inject.mouse_dirty = true;
}

uint32_t kmbox_frame_count(void) { return frames_ok; }
uint32_t kmbox_error_count(void) { return frames_err; }
uint32_t kmbox_rx_byte_count(void) { return rx_bytes_total; }
static void apply_mouse_result(int16_t dx, int16_t dy, uint8_t buttons,
                               int8_t wheel, bool use_smooth)
{
	inject.mouse_buttons = buttons;
	inject.mouse_wheel += wheel;

	if (use_smooth && (dx != 0 || dy != 0)) {
		smooth_inject(dx, dy);
		if (buttons != 0 || wheel != 0)
			inject.mouse_dirty = true;
	} else {
		inject.mouse_dx += dx;
		inject.mouse_dy += dy;
		inject.mouse_dirty = true;
	}
}

void kmbox_inject_mouse(int16_t dx, int16_t dy, uint8_t buttons,
                        int8_t wheel, bool use_smooth)
{
	apply_mouse_result(dx, dy, buttons, wheel, use_smooth);
}

void kmbox_inject_keyboard(uint8_t modifier, const uint8_t keys[6])
{
	inject.kb_modifier = modifier;
	memcpy(inject.kb_keys, keys, 6);
	inject.kb_dirty = true;
}

static void dispatch_kmbox_frame(void)
{
	switch (frame_cmd) {
	case KMBOX_CMD_MOUSE_MOVE:
		if (frame_len >= 4) {
			inject.mouse_dx += (int16_t)(frame_buf[0] | (frame_buf[1] << 8));
			inject.mouse_dy += (int16_t)(frame_buf[2] | (frame_buf[3] << 8));
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_BUTTON:
		if (frame_len >= 1) {
			inject.mouse_buttons = frame_buf[0];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_WHEEL:
		if (frame_len >= 1) {
			inject.mouse_wheel += (int8_t)frame_buf[0];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_ALL:
		if (frame_len >= 6) {
			inject.mouse_buttons = frame_buf[0];
			inject.mouse_dx += (int16_t)(frame_buf[1] | (frame_buf[2] << 8));
			inject.mouse_dy += (int16_t)(frame_buf[3] | (frame_buf[4] << 8));
			inject.mouse_wheel += (int8_t)frame_buf[5];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_KEYBOARD:
		if (frame_len >= 8) {
			inject.kb_modifier = frame_buf[0];
			memcpy(inject.kb_keys, &frame_buf[2], 6);
			inject.kb_dirty = true;
		}
		break;

