VoltCyclone/imxrtnsy/src/kmbox.c
	case KMBOX_CMD_KEYBOARD_REL:
		inject.kb_modifier = 0;
		memset(inject.kb_keys, 0, 6);
		inject.kb_dirty = true; // must send zero-report to release keys on host
		break;

	case KMBOX_CMD_SMOOTH_MOVE:
		if (frame_len >= 4) {
			int16_t x = (int16_t)(frame_buf[0] | (frame_buf[1] << 8));
			int16_t y = (int16_t)(frame_buf[2] | (frame_buf[3] << 8));
			smooth_inject(x, y);
		}
		break;

	case KMBOX_CMD_SMOOTH_CONFIG:
		if (frame_len >= 1) {
			smooth_set_max_per_frame((int16_t)frame_buf[0]);
		}
		break;

	case KMBOX_CMD_SMOOTH_CLEAR:
		smooth_clear();
		break;

	case KMBOX_CMD_PING:
		tx_enqueue(0xFE);
		break;

	default:
		break;
	}
}
static void makcu_send_response(uint8_t cmd, const uint8_t *payload, uint8_t plen)
{
	tx_enqueue(MAKCU_SYNC_BYTE);
	tx_enqueue(cmd);
	tx_enqueue(plen & 0xFF);
	tx_enqueue((plen >> 8) & 0xFF);
	if (plen > 0)
		tx_enqueue_buf(payload, plen);
}
static void dispatch_makcu_frame(void)
{
	makcu_result_t result;
	if (makcu_parse_command(mk_cmd, mk_buf, mk_len, &result)) {
		if (result.has_mouse) {
			apply_mouse_result(result.mouse_dx, result.mouse_dy,
			                   result.mouse_buttons, result.mouse_wheel,
			                   true);
		}
		if (result.has_keyboard) {
			inject.kb_modifier = result.kb_modifier;
			memcpy(inject.kb_keys, result.kb_keys, 6);
			inject.kb_dirty = true;
		}
		if (result.click_release) {
			inject.click_release_mask = result.mouse_buttons;
			inject.click_release_at = millis() + 30;
		}
		if (result.needs_response) {
			makcu_send_response(result.resp_cmd, result.resp_payload,
			                    result.resp_payload_len);
		}
	}
}

static void dispatch_ferrum_line(void)
{
	ferrum_result_t result;
	if (ferrum_parse_line(ferrum_line, ferrum_pos, &result)) {
		if (result.has_mouse) {
			apply_mouse_result(result.mouse_dx, result.mouse_dy,
			                   result.mouse_buttons, result.mouse_wheel,
			                   true);
		}
		if (result.click_release) {
			inject.click_release_mask = result.mouse_buttons;
			inject.click_release_at = millis() + 30;
		}
		if (result.needs_response) {
			if (result.text_response)
				tx_enqueue_str(result.text_response);
			static const uint8_t resp[] = { '>', '>', '>', '\r', '\n' };
			tx_enqueue_buf(resp, 5);
		}
	}
}
